Public Attributes | List of all members
API_RailingHorizontalPosData Struct Reference
Element Manager
Represents the horizontal alignment of a Railing subelement. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | position
The horizontal position of the element.
 bool  | isStretchable
True, if the element can be stretched.
Detailed Description
Represents the horizontal alignment of a Railing subelement.